Keras 2 layers could not be imported defaulting to keras1
TheanoShapedU-NET
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 1, 512, 512)   0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 64, 256, 256)  640         input_1[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 64, 256, 256)  256         convolution2d_1[0][0]            
____________________________________________________________________________________________________
leakyrelu_1 (LeakyReLU)          (None, 64, 256, 256)  0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 128, 128, 128) 73856       leakyrelu_1[0][0]                
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 128, 128, 128) 512         convolution2d_2[0][0]            
____________________________________________________________________________________________________
leakyrelu_2 (LeakyReLU)          (None, 128, 128, 128) 0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 256, 64, 64)   295168      leakyrelu_2[0][0]                
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 256, 64, 64)   1024        convolution2d_3[0][0]            
____________________________________________________________________________________________________
leakyrelu_3 (LeakyReLU)          (None, 256, 64, 64)   0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 512, 32, 32)   1180160     leakyrelu_3[0][0]                
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 512, 32, 32)   2048        convolution2d_4[0][0]            
____________________________________________________________________________________________________
leakyrelu_4 (LeakyReLU)          (None, 512, 32, 32)   0           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 512, 16, 16)   2359808     leakyrelu_4[0][0]                
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 512, 16, 16)   2048        convolution2d_5[0][0]            
____________________________________________________________________________________________________
leakyrelu_5 (LeakyReLU)          (None, 512, 16, 16)   0           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 512, 8, 8)     2359808     leakyrelu_5[0][0]                
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 512, 8, 8)     2048        convolution2d_6[0][0]            
____________________________________________________________________________________________________
leakyrelu_6 (LeakyReLU)          (None, 512, 8, 8)     0           batchnormalization_6[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 512, 4, 4)     2359808     leakyrelu_6[0][0]                
____________________________________________________________________________________________________
batchnormalization_7 (BatchNorma (None, 512, 4, 4)     2048        convolution2d_7[0][0]            
____________________________________________________________________________________________________
leakyrelu_7 (LeakyReLU)          (None, 512, 4, 4)     0           batchnormalization_7[0][0]       
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 512, 2, 2)     2359808     leakyrelu_7[0][0]                
____________________________________________________________________________________________________
batchnormalization_8 (BatchNorma (None, 512, 2, 2)     2048        convolution2d_8[0][0]            
____________________________________________________________________________________________________
leakyrelu_8 (LeakyReLU)          (None, 512, 2, 2)     0           batchnormalization_8[0][0]       
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 512, 1, 1)     1049088     leakyrelu_8[0][0]                
____________________________________________________________________________________________________
batchnormalization_9 (BatchNorma (None, 512, 1, 1)     2048        convolution2d_9[0][0]            
____________________________________________________________________________________________________
leakyrelu_9 (LeakyReLU)          (None, 512, 1, 1)     0           batchnormalization_9[0][0]       
____________________________________________________________________________________________________
deconvolution2d_1 (Deconvolution (None, 512, 2, 2)     1049088     leakyrelu_9[0][0]                
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorm (None, 512, 2, 2)     2048        deconvolution2d_1[0][0]          
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 512, 2, 2)     0           batchnormalization_10[0][0]      
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 1024, 2, 2)    0           dropout_1[0][0]                  
                                                                   batchnormalization_8[0][0]       
____________________________________________________________________________________________________
leakyrelu_10 (LeakyReLU)         (None, 1024, 2, 2)    0           merge_1[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_2 (Deconvolution (None, 512, 4, 4)     2097664     leakyrelu_10[0][0]               
____________________________________________________________________________________________________
batchnormalization_11 (BatchNorm (None, 512, 4, 4)     2048        deconvolution2d_2[0][0]          
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 512, 4, 4)     0           batchnormalization_11[0][0]      
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 1024, 4, 4)    0           dropout_2[0][0]                  
                                                                   batchnormalization_7[0][0]       
____________________________________________________________________________________________________
leakyrelu_11 (LeakyReLU)         (None, 1024, 4, 4)    0           merge_2[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_3 (Deconvolution (None, 512, 8, 8)     2097664     leakyrelu_11[0][0]               
____________________________________________________________________________________________________
batchnormalization_12 (BatchNorm (None, 512, 8, 8)     2048        deconvolution2d_3[0][0]          
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 512, 8, 8)     0           batchnormalization_12[0][0]      
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 1024, 8, 8)    0           dropout_3[0][0]                  
                                                                   batchnormalization_6[0][0]       
____________________________________________________________________________________________________
leakyrelu_12 (LeakyReLU)         (None, 1024, 8, 8)    0           merge_3[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_4 (Deconvolution (None, 512, 16, 16)   2097664     leakyrelu_12[0][0]               
____________________________________________________________________________________________________
batchnormalization_13 (BatchNorm (None, 512, 16, 16)   2048        deconvolution2d_4[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 1024, 16, 16)  0           batchnormalization_13[0][0]      
                                                                   batchnormalization_5[0][0]       
____________________________________________________________________________________________________
leakyrelu_13 (LeakyReLU)         (None, 1024, 16, 16)  0           merge_4[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_5 (Deconvolution (None, 512, 32, 32)   2097664     leakyrelu_13[0][0]               
____________________________________________________________________________________________________
batchnormalization_14 (BatchNorm (None, 512, 32, 32)   2048        deconvolution2d_5[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 1024, 32, 32)  0           batchnormalization_14[0][0]      
                                                                   batchnormalization_4[0][0]       
____________________________________________________________________________________________________
leakyrelu_14 (LeakyReLU)         (None, 1024, 32, 32)  0           merge_5[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_6 (Deconvolution (None, 256, 64, 64)   1048832     leakyrelu_14[0][0]               
____________________________________________________________________________________________________
batchnormalization_15 (BatchNorm (None, 256, 64, 64)   1024        deconvolution2d_6[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 512, 64, 64)   0           batchnormalization_15[0][0]      
                                                                   batchnormalization_3[0][0]       
____________________________________________________________________________________________________
leakyrelu_15 (LeakyReLU)         (None, 512, 64, 64)   0           merge_6[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_7 (Deconvolution (None, 128, 128, 128) 262272      leakyrelu_15[0][0]               
____________________________________________________________________________________________________
batchnormalization_16 (BatchNorm (None, 128, 128, 128) 512         deconvolution2d_7[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 256, 128, 128) 0           batchnormalization_16[0][0]      
                                                                   batchnormalization_2[0][0]       
____________________________________________________________________________________________________
leakyrelu_16 (LeakyReLU)         (None, 256, 128, 128) 0           merge_7[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_8 (Deconvolution (None, 64, 256, 256)  65600       leakyrelu_16[0][0]               
____________________________________________________________________________________________________
batchnormalization_17 (BatchNorm (None, 64, 256, 256)  256         deconvolution2d_8[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 128, 256, 256) 0           batchnormalization_17[0][0]      
                                                                   batchnormalization_1[0][0]       
____________________________________________________________________________________________________
leakyrelu_17 (LeakyReLU)         (None, 128, 256, 256) 0           merge_8[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_9 (Deconvolution (None, 3, 512, 512)   1539        leakyrelu_17[0][0]               
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 3, 512, 512)   0           deconvolution2d_9[0][0]          
====================================================================================================
Total params: 22,882,243
Trainable params: 22,869,187
Non-trainable params: 13,056
____________________________________________________________________________________________________
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 4, 512, 512)   0                                            
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 32, 256, 256)  1184        input_2[0][0]                    
____________________________________________________________________________________________________
leakyrelu_18 (LeakyReLU)         (None, 32, 256, 256)  0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 64, 128, 128)  18496       leakyrelu_18[0][0]               
____________________________________________________________________________________________________
leakyrelu_19 (LeakyReLU)         (None, 64, 128, 128)  0           convolution2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 128, 64, 64)   73856       leakyrelu_19[0][0]               
____________________________________________________________________________________________________
leakyrelu_20 (LeakyReLU)         (None, 128, 64, 64)   0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 256, 32, 32)   295168      leakyrelu_20[0][0]               
_________________________________________________________________